package com.tesobe.obp

import com.tesobe.obp.Nt1cTMf._

class Nt1cTMfTest extends ServerSetup {

  implicit val formats = net.liftweb.json.DefaultFormats
  

  
  test("getCompletedTransactions works") {
    val result = getNt1cT(
      "N7jut8d",
      "814",
      "330",
      "20102612",
      "<~9          81433020102612",
      List("2016",
        "01",
        "01"),
      List("2017", "06", "01"),
      "15"
    )
   result should be (Right(Nt1cT(N2TshuvaTavlait(N2TshuvaTavlaitContent("15",Tn2Tnuot(List(Tn2TnuaBodedet(Tn2TnuaBodedetContent("1","0","פרעון הלוואה","-1312.21","20160201","5611001","-7192.83","20160201","2","10","2016","19","326","0","12","20160201","","1063771","0","0")),
      Tn2TnuaBodedet(Tn2TnuaBodedetContent("1","0","קופת גמל עצמה","9618.36","20160201","999535","2425.53","20160201","2","13","2016","20","304","0","11","20160202","","666214","0","0")),
      Tn2TnuaBodedet(Tn2TnuaBodedetContent("1","0","לאומי ויזה י","-4135.41","20160202","271523","-1709.88","20160202","2","3","2016","21","22675","0","12","20160202","","666218","0","0")),
      Tn2TnuaBodedet(Tn2TnuaBodedetContent("1","0","הק בורסה קנ.","-496.35","20160202","51459","-2206.23","20160202","2","5","2016","22","308","0","12","20160202","","666216","0","0")),
      Tn2TnuaBodedet(Tn2TnuaBodedetContent("1","0","הק בורסה קנ.","-496.71","20160202","53176","-2702.94","20160202","2","5","2016","23","308","0","12","20160202","","666217","0","0")),
      Tn2TnuaBodedet(Tn2TnuaBodedetContent("1","1","הע. אינטרנט700","1300.00","20160202","42126","-1402.94","20160202","2","15","2016","24","22517","13","11","20160202","העברה מאת: איבגי עידית ומשה 10-800-040663393 הלוואה","666215","0","0")), Tn2TnuaBodedet(Tn2TnuaBodedetContent("1","0","העברה/הפק80040","-18.41","20160203","78055","-1421.35","20160203","2","15","2016","25","56473","0","12","20160203","","301243","0","0")),
      Tn2TnuaBodedet(Tn2TnuaBodedetContent("1","0","מפעל הפיס-זכ-י","11.00","20160203","13951","-1410.35","20160203","2","4","2016","26","482","8","11","20160203","העברה מאת: מפעל הפיס 12-600-000493018 זכיה בפיס","301242","1","10")), Tn2TnuaBodedet(Tn2TnuaBodedetContent("1","0","מכבי-י","-269.37","20160205","25300","-1679.72","20160205","2","6","2016","27","7986","0","12","20160205","","324735","1","0")),
      Tn2TnuaBodedet(Tn2TnuaBodedetContent("1","1","העברה עצמית700","-4000.00","20160205","19297","-5679.72","20160205","2","15","2016","28","2142","13","12","20160205","העברה עבור:               סניור  אליהו 10-800-040606014 קרוב משפחה","324736","0","0")),
      Tn2TnuaBodedet(Tn2TnuaBodedetContent("0","1","הע. אינטרנט700","-300.00","20160214","53579","-5979.72","20160214","1","15","2016","1","22517","13","12","20160214","העברה אל: רחל קארו 12-170-000046656 עבור קרם פנים","271673","1","80")),
      Tn2TnuaBodedet(Tn2TnuaBodedetContent("0","0","שיק      31188","-50.00","20160222","5550438","-6029.72","20160222","1","2","2016","2","125","0","42","20160222","","339885","0","0")),
      Tn2TnuaBodedet(Tn2TnuaBodedetContent("0","0","כספומט י","-1000.00","20160315","150312","-5563.54","20160315","1","7","2016","25","150","0","12","20160315","","677073","0","0")),
      Tn2TnuaBodedet(Tn2TnuaBodedetContent("0","0","מכבי-י","293.00","20160720","14219","-13883.10","20160720","3","4","2016","29","3376","8","11","20160720","העברה מאת: קרן מכבי 10-800-023528297 החזר גביה","427757","1","10")),
      Tn2TnuaBodedet(Tn2TnuaBodedetContent("0","1","הע. אינטרנט700","-1000.00","20161025","11253","22734.62","20161025","5","15","2016","21","22517","13","12","20161025","העברה אל: ארגז שרון 20-571-000153413 קרוב משפחה","346926","1","80")))))))))
  }

}
